semestr2/logika/01.03.2021-język-cd.md

# Table of Contents

1.  [Język cd](#orgb0c4fd9)
    1.  [Stopnie języka](#org0fc7367)
    2.  [najważniejsze funkcje języka](#org1d62b87)
        1.  [funkcja opisowa](#orgdf6e836)
        2.  [funkcja emotywna, ekspresyjna](#org6797ae3)
        3.  [funkcja sprawcza](#org1102da4)
        4.  [funckja dyrektywna](#org47ecc02)
        5.  [funkcja magiczna](#org5172684)
        6.  [funkcja estetyczna](#org6eec63e)
        7.  [funkcja metajęzykowa](#org7519e3b)



<a id="orgb0c4fd9"></a>

# Język cd


<a id="org0fc7367"></a>

## Stopnie języka

-   język I stopnia - opisujemy rzeczywistość pozajęzykową
-   język II stopnia - opisujemy język poprzedniego stopnia
-   język III stopnia - opisujemy język poprzedniego stopna , itd

-   np I - język prawa, II - język prawniczy (mówi o języku prawa)

-   w językach etnicznych (naturalnych) trudno odróżnić stopnie języka (rezultatem jest wieloznaczność wypowiedzi)

-   problem: wypowiedzi w metajęzyku mogą być zrozumiane jako wypowiedzi w I stopniu

-   jezeli zmiesza się języki różnych stopni w języku naturalnym moze dojsć do paradoksów, np paradkos kłamcy
-   aby uniknąć tego typu paradoksow należy wyrażnie rozdzielić poiomy języka w wypowiedzi


<a id="org1d62b87"></a>

## najważniejsze funkcje języka


<a id="orgdf6e836"></a>

### funkcja opisowa

-   tym zajmuje się logika


<a id="org6797ae3"></a>

### funkcja emotywna, ekspresyjna

-   wyraża stany emocjonalne


<a id="org1102da4"></a>

### funkcja sprawcza

-   zobowiązania, przysięgi, wyroki


<a id="org47ecc02"></a>

### funckja dyrektywna

-   wyraża polecenie (otwórz okno) lub wywołuje jakieś działanie (ktora godzina)


<a id="org5172684"></a>

### funkcja magiczna

-   przekleństwa, życzenia, powiedzenia


<a id="org6eec63e"></a>

### funkcja estetyczna


<a id="org7519e3b"></a>

### funkcja metajęzykowa

